Revit 2026 API

# LeaderLeaderShape Property

---

Geometric style of the leader

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public LeaderShape LeaderShape { get; }
```
```vb
Public ReadOnly Property LeaderShape As LeaderShape
	Get
```
```cpp
public:
property LeaderShape LeaderShape {
	LeaderShape get ();
}
```
```fsharp
member LeaderShape : LeaderShape with get
```

#### Property Value

LeaderShape

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The leader is not currently owned by a valid element. A probable reason for that could be if the element has been independently deleted, or the leader has never been properly initialized. |

While this property cannot be changed directly, it can change, with limitations, as an effect of other changes to either the leader itself or the annotation element the leader is associated with. For example, straight-line leaders have no elbow points; but if an elbow point is set for a straight leader, which is allowed, it will effectively change the leader's shape to a kinked line.

#### Reference

Leader Class

Autodesk.Revit.DB Namespace